# Задача 10:
# На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты
# вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть
import random


def coin(n: int) -> int:
    eagle = 0
    count = 0
    coins = [0, 1]
    for i in range(n):
        random.shuffle(coins)
        print(f'Все монеты: {coins}')
        if int(coins[0]) == 0:
            count += 1

    if count < n/2:
        return count
    return n - count


n = int(input("Введите количество монет: "))
print(f'Количество монет которое необходимо перевернуть: {coin(n)}')
