# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке,
# причём кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних.
# Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора
# на них выросло различное число ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модулем и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом,
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль,
# находясь перед некоторым кустом заданной во входном файле грядки.

from random import randint


def blueberries(count_bush: int, bush_number: int) -> int:
    beds = list(randint(5, 10) for i in range(count_bush))
    print(beds)
    result = beds[bush_number] + beds[bush_number - 1] + beds[bush_number - 2]
    return result


count = int(input('Введите количество кустов: '))
number = int(input('Введите № куста: '))
print(f'Количество ягод: {blueberries(count, number)}')
